基本工资            1                      2125
绩效工资            2                      1700
保密工资            3                      425
绩效浮动            4                      0
其它津贴            5                      200
其他扣款            6                      0
个人交社保          7                      363.66
个人交公积金        8                      212.5
应发合计            9=1+2+3+4+5-6-7-8      3873.84
其他免税所得        10                     0
计税合计            11=9-10                3873.84
代扣税              12                     11.22
个人借款            13                     0
实发合计            14=11-12-13            3862.62
公司交社保          15                     640.51
公司交公积金        16                     212.5
人力成本            17=9+7+8+15+16         5303.01


#eat:
#21 days per month:
21*(20+6+10)=21*36=756
#9 days per month:
9*(6*8*10)=9*24=216
#one month:
756+216=972
#trip:
21*10=210
#rent:
1200

#spending:
972+210+1200=1182+1200=2382


#month:8,9,10:
3862+420=4282
#month:11:
3862+420+750=5043


#total:
(4282-2382)*3=1900*3=5700