
#------------------------------------------------------------------------------
>>    No. 
>>    DateStart 
>>    TaskDetail

>>    Status ToDo
>>    Script
#-------------------------------------------------
#    No. 32
#-------------------------------------------------
>>    DateStart 2016/10/09
>>    TaskDetail
大宽表导数据到远程测试库
导数其他营销场景（2016/10/11）
造数到各营销场景表的波次二中（2016/10/12）
>>    Status InProcess
>>    Script
d_mc_info_sum.q
>>    Remark
脚本文件：/appcom/apps/hduser0301/xt_cfbdm_d_e/xt_cfbdm_d_e_026_cd/shell/export_d_mc_info_sum.sh
参数文件：/appcom/apps/hduser0301/xt_cfbdm_d_e/xt_cfbdm_d_e_026_cd/cfbdm.properties
pgAdminSchema:  cfbmcrtm/cfbmcrtm/public/d_mc_info_sum
#-------------------------------------------------
#    No. 31
#-------------------------------------------------
>>    DateStart 2016/10/09
>>    TaskDetail
统计自分配时间后，连续30天内每天的交易客户数
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 30
#-------------------------------------------------
>>    DateStart 2016/10/09
>>    TaskDetail
已操作信息汇总表增加坐席回流表中接触结果为09-自动结案的客户
SIT测试（2016/10/10）
>>    Status Dead
>>    Script
d_mc_alrdy_oper_cust_info_sum.q
#-------------------------------------------------
#    No. 29
#-------------------------------------------------
>>    DateStart 2016/09/30
>>    TaskDetail
灵活查询_渠道活动效果清单，新增三个字段
SIT测试（2016/10/10）
>>    Status Done
>>    Script
d_fq_chan_activ_eff_list.q
#-------------------------------------------------
#    No. 28
#-------------------------------------------------
>>    DateStart 2016/09/29
>>    TaskDetail
新增脚本"基金产品"
SIT测试（2016/10/09）
>>    Status Done
>>    Script
l_prod_fund_prod.q
#-------------------------------------------------
#    No. 27
#-------------------------------------------------
>>    DateStart 2016/09/29
>>    TaskDetail
运营日报累计交易客户数计算重复
>>    Status Done
>>    Script
d_daily_operations_cust.q
#-------------------------------------------------
#    No. 26
#-------------------------------------------------
>>    DateStart 2016/09/28
>>    TaskDetail
高净值相关表数据，导入MySql
>>    DateEnd 2016/09/28
>>    Status Done
>>    Script
d_mc_estim_hnet_val_cust.q
d_mc_estim_hval_cust_sev_recmd.q
#-------------------------------------------------
#    No. 25
#-------------------------------------------------
>>    DateStart 2016/09/26
>>    TaskDetail
客户定期产品到期推荐脚本修改
SIT测试（2016/09/28）
脚本评审,新增三个字段（2016/09/29）
新增字段：到期合同编号。修改波次二，分组一。（2016/10/08）
>>    Status InProcess
>>    Script
d_mc_fix_time_prod_matr_recmd.q
#-------------------------------------------------
#    No. 22
#-------------------------------------------------
>>    DateStart 2016/9/21
>>    TaskDetail
当前仅持有活期产品客户推荐定期产品新增
SIT测试（2016/09/26）
脚本评审,新增三个字段（2016/09/29）
映射整理（2016/09/30）
>>    Status InProcess
>>    Script
d_mc_only_hold_curr_prod.q
#-------------------------------------------------
#    No. 1
#-------------------------------------------------
>>    DateStart 2016/8/27
>>    TaskDetail
调整仪表盘日、周、月活跃率
>>    DateEnd 2016/8/30
>>    Status Done
>>    Script
d_dailyash_board_vt4.q 
d_dailyash_board_vt3.q
d_dailyash_board_vt1.q
#-------------------------------------------------
#    No. 2
#-------------------------------------------------
>>    DateStart 2016/8/29
>>    TaskDetail
修改后评估促交易脚本
>>    DateEnd 2016/9/1
>>    Status Done
>>    Script
d_mc_estim_prom_tx.q
#-------------------------------------------------
#    No. 3
#-------------------------------------------------
>>    DateStart 2016/8/29
>>    TaskDetail
Data Mining
>>    DateEnd 2016/9/12
>>    Status Stop
>>    Script
#-------------------------------------------------
#    No. 4
#-------------------------------------------------
>>    DateStart 2016/8/30
>>    TaskDetail
Novel Reading
>>    DateEnd 2016/9/12
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 5
#-------------------------------------------------
>>    DateStart 2016/8/31
>>    TaskDetail
运营日报、月报SIT测试报告
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 6
#-------------------------------------------------
>>    DateStart 2016/8/31
>>    TaskDetail
大额客户投资提醒MYSQL导数据
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 7
#-------------------------------------------------
>>    DateStart 2016/9/1
>>    TaskDetail
报表截图作投产后对比用
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 8
#-------------------------------------------------
>>    DateStart 2016/9/2
>>    TaskDetail
映射修改
>>    Status Dead
>>    Script
#-------------------------------------------------
#    No. 9
#-------------------------------------------------
>>    DateStart 2016/9/2
>>    TaskDetail
促交易SIT测试报告
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 10
#-------------------------------------------------
>>    DateStart 2016/9/2
>>    TaskDetail
精选基金口径核对
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 11
#-------------------------------------------------
>>    DateStart 2016/9/5
>>    TaskDetail
客户投资行为去除Group by验数
>>    Status Dead
>>    Script
#-------------------------------------------------
#    No. 12
#-------------------------------------------------
>>    DateStart 2016/9/5
>>    TaskDetail
投产前后数据对比
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 13
#-------------------------------------------------
>>    DateStart 2016/9/7
>>    TaskDetail
基金L层脚本开发新增
>>    DateEnd 2016/9/8
>>    Status Done
>>    Script
l_cust_hold_prod_info_fund.q
l_cust_invest_behav_fund.q
#-------------------------------------------------
#    No. 14
#-------------------------------------------------
>>    DateStart 2016/9/8
>>    TaskDetail
L层客户持有资产信息表修改
>>    DateEnd 2016/9/12
>>    Status Done
>>    Script
l_cust_hold_asset_info.q
#-------------------------------------------------
#    No. 15
#-------------------------------------------------
>>    DateStart 2016/9/8
>>    TaskDetail
D层灵活查询修改
>>    DateEnd 2016/9/13
>>    Status Done
>>    Script
d_fq_cust_hold_asset_info.q
#-------------------------------------------------
#    No. 16
#-------------------------------------------------
>>    DateStart 2016/9/9
>>    TaskDetail
L层客户基金产品投资表新增
>>    DateEnd 2016/9/13
>>    Status Done
>>    Script
l_cust_fund_prod_invest.q
#-------------------------------------------------
#    No. 17
#-------------------------------------------------
>>    DateStart 2016/9/13
>>    TaskDetail
SIT报告
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 18
#-------------------------------------------------
>>    DateStart 2016/9/14
>>    TaskDetail
远程测试库导数据
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 19
#-------------------------------------------------
>>    DateStart 2016/9/18
>>    TaskDetail
已绑卡未交易增加波次二
>>    Status Done
>>    Script
d_mc_tie_card_not_tx_prom_tx.q
#-------------------------------------------------
#    No. 20
#-------------------------------------------------
>>    DateStart 2016/9/20
>>    TaskDetail
灵活查询基金产品投资脚本开发新增
>>    Status Done
>>    Script
d_fq_cust_fund_prod_invest.q
#-------------------------------------------------
#    No. 21
#-------------------------------------------------
>>    DateStart 2016/9/21
>>    TaskDetail
版本依赖检查
>>    DateEnd 2016/9/21
>>    Status Done
>>    Script
#-------------------------------------------------
#    No. 23
#-------------------------------------------------
>>    DateStart 2016/9/21
>>    TaskDetail
整理SO层脚本依赖
>>    DateEnd 2016/9/21
>>    Status Done
>>    Script
l_cust_prefer_prod_info.q
l_cust_bat_label_info.q
#-------------------------------------------------
#    No. 24
#-------------------------------------------------
>>    DateStart 2016/9/22
>>    TaskDetail
点睛锁屏渠道和天天德州渠道数据核对
>>    DateEnd 2016/9/22
>>    Status Done
>>    Script
d_fq_chan_activ_eff_list     

